OpenDTEF-v1812/tutorials/multiphase/icoReactingMultiPhaseInterFoam/inertMultiphaseMultiComponent/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions     [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }

    top
    {
        type            calculated;
        value           $internalField;
    }

    left
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
         value          $internalField;
    }

    right
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
         value          $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
